views/modifier/update.php

	<?= $form->field($model, 'status')->checkbox(); ?>

	<?php
	$service=Service::find()->all();
---
SELECT * FROM `service`



	<?php
	$tipo_mod=TypeModifier::find()->all();
---
SELECT * FROM `type_modifier`