controllers/AddressController.php

    protected function findModel($id) {
        if (($model = Address::findOne($id)) !== null) {
---
SELECT * FROM `address` WHERE `id`='2'

    public function actionGetUserAddress() {

        Yii::$app->response->format = 'json';
        $token = Yii::$app->request->post("token", null);

        $model_token = LogToken::find ()
            ->where ([
                'token' => $token,
                'status' => 1])
            ->one ();

        if (isset($model_token) && !empty($model_token)) {

            Yii::info('No se pudo eliminar la dirección.', 'get-user-address');
            $model = Address::find()
                    ->select(['address.id', 'address', 'tower_apartment', 'housing_type', 'type_housing_id', 'custom_address', 'lat', 'lng'])
                    ->joinwith('userHasAddress')
                    ->joinwith('typeHousing')
                    ->where(['user_has_address.user_id' => $model_token->FK_id_user, 'enable' => '1'])
                    ->asArray()
                    ->all();
---
SELECT * FROM `log_token` WHERE `token`='0369aa069b1280858f3343854bcee3fb'
SELECT * FROM `type_housing` WHERE `id` IN ('3', '5')
SELECT * FROM `user_has_address` WHERE `address_id` IN ('1', '2')
SELECT `address`.`id`, `address`, `tower_apartment`, `housing_type`, `type_housing_id`, `custom_address`, `lat`, `lng` FROM `address` LEFT JOIN `user_has_address` ON `address`.`id` = `user_has_address`.`address_id` LEFT JOIN `type_housing` ON `address`.`type_housing_id` = `type_housing`.`id` WHERE (`user_has_address`.`user_id`=115) AND (`enable`='1')