controllers/CategoryServiceController.php

    public function actionGetCategorias() {

        Yii::$app->response->format = 'json';
        $model = CategoryService::find()
                        ->select(['category_service.id', 'category_service.description', 'category_service.status', 'category_service.icon'])
                        ->where(['category_service.status' => '1'])
                        ->joinwith(['service'])
                        ->joinwith(['service.serviceHasModifier.modifier' => function ($query) {
                                $query->select(['id', 'name', 'description', 'price', 'tax', 'status', 'duration']);
                            }])
                         ->asArray()->all();
---
SELECT * FROM `service_has_modifier` WHERE `service_id` IN ('10', '11', '12')
SELECT * FROM `service` WHERE `category_service_id` IN ('17', '19')
SELECT `category_service`.`id`, `category_service`.`description`, `category_service`.`status`, `category_service`.`icon` FROM `category_service` LEFT JOIN `service` ON `category_service`.`id` = `service`.`category_service_id` LEFT JOIN `service_has_modifier` ON `service`.`id` = `service_has_modifier`.`service_id` LEFT JOIN `modifier` ON `service_has_modifier`.`modifier_id` = `modifier`.`id` WHERE `category_service`.`status`='1'
SELECT `id`, `name`, `description`, `price`, `tax`, `status`, `duration` FROM `modifier` WHERE `id` IN ('58', '59', '60', '61', '62', '63', '64', '65', '66')