controllers/ChatController.php

	public function actionSendMessage() {
		Yii::$app->response->format = 'json';

		$token = Yii::$app->request->post ( 'token', '' );
		$service = Yii::$app->request->post ( 'assigned_service_id', '' );
		$message = Yii::$app->request->post ( 'message', '' );
		$event = Yii::$app->request->post ( 'event', '' );

		$model_token = LogToken::find ()->where ( [
				'token' => $token
		] )->one ();
---
SELECT * FROM `log_token` WHERE `token`='db98e73dea6bf090ab2be99bb1a732b8'

		}

		//enviar notificacion
		$tokens = Expert::findOne ( [
				"id" => $model_service->expert_id
		] )->getPushTokens ();
---
SELECT * FROM `expert` WHERE `id`=38

			return $response;
			// Yii::$app->response->statusCode = 200;
		}
		$tokens = User::findOne ( [
				"id" => $id_user
		] )->getPushTokens ();
---
SELECT * FROM `log_token` WHERE `token`='8ad186d7befd158ee6ce70c263e3c748'