controllers/ExpertController.php

SELECT * FROM `expert` WHERE `email`='jaholguin@me.com'
---
	public function actionLoginExpert() {
		$correo = $_POST ['login'];
		// $cost='4';
		$contrasena = $_POST ['password'];

		$searched = Expert::find ()->where ( [
				'email' => $correo
		] )->one ();

SELECT * FROM `gcm_token_expert` WHERE (`expert_id`=38) AND (`type_token_id`='2')
---
			return $response;
		} // Se hace match de contraseñas
		  // Buscamos y actualizamos el token GCM
		$gcm_token = GcmTokenExpert::find ()->where ( [
				"expert_id" => $searched->id,
				"type_token_id" => $device
		] )->one ();

SELECT * FROM `expert_has_service` WHERE `expert_id`='38'
SELECT `expert`.* FROM `expert` LEFT JOIN `expert_has_service` ON `expert`.`id` = `expert_has_service`.`expert_id` WHERE `id`='38'
---
	public function actionInmediato() {
		Yii::$app->response->format = 'json';
		$lat = Yii::$app->request->post ( "lat", null );
		$lng = Yii::$app->request->post ( "lng", null );
		$expert_id = Yii::$app->request->post ( "id_especialista", null );
		$event = Yii::$app->request->post ( "event", null );

		// $_POST['text']='Mensaje desde el servidor: '.$_POST['text'];
		// var_dump(Yii::$app->request->post());
		$pusher = new Pusher ( Yii::$app->params ['pusher_app_key'], Yii::$app->params ['pusher_app_secret'], Yii::$app->params ['pusher_app_id'] );
		// print 'Hell wrld';
		// $_POST['id']=$expert_id;

		$model = Expert::find ()->where ( [
				'id' => $expert_id
		] )->joinWith ( 'expertHasService' )->asArray ()->one ();