controllers/ModifierController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
        	$model_relation=ServiceHasModifier::find()->where(["modifier_id"=>$model->id])->one();
        	$model_relation->service_id=Yii::$app->request->post('Modifier')['service_id'];
        	if($model_relation->save()){
        		   return $this->redirect(['view', 'id' => $model->id]);
        	}
        	else{var_dump( $model_relation->errors);}


        } else {
        	$model_relation=ServiceHasModifier::find()->where(["modifier_id"=>$model->id])->one();
---
SELECT * FROM `service_has_modifier` WHERE `modifier_id`=51

    protected function findModel($id)
    {
        if (($model = Modifier::findOne($id)) !== null) {
---
SELECT * FROM `modifier` WHERE `id`='39'