controllers/ServiceHistoryController.php

	public function actionActualService() {
		Yii::$app->response->format = 'json';

		$token = Yii::$app->request->post ( "token", null );

		$model_token = LogToken::find ()->where ( [
				'token' => $token
		] )->one ();

		// var_dump($searched);

		if ($model_token != null) {

			$model_history = VwActualService::find ()->where ( [
					'user_id' => $model_token->FK_id_user
			] )->asArray ()->all ();
---
SELECT * FROM `log_token` WHERE `token`='8ad186d7befd158ee6ce70c263e3c748'
SELECT * FROM `vw_actual_service` WHERE `user_id`=115