controllers/TypeHousingController.php

SELECT * FROM `type_housing`
---
    public function actionGetTypeHousing()
    {
    	Yii::$app->response->format = 'json';

    	$model=TypeHousing::find()->asArray()->all();