controllers/UserController.php

UPDATE `log_token` SET `status`=0 WHERE (`FK_id_user`=115) AND (`FK_id_token_type`=2) AND (`status`=1)
---
		// se crea el token del nuevo usuario mmz
		$tokenMmz = new LogToken ();
		$token = MD5 ( $user->id . $user->email . time () );
		$updateTokens = LogToken::updateAll ( [
				'status' => 0
		], [
				'FK_id_user' => $user->id,
				'FK_id_token_type' => $typeToken->id,
				'status' => 1
		] );

INSERT INTO `log_token` (`token`, `connection_ip`, `status`, `FK_id_token_type`, `FK_id_user`, `created_date`, `updated_date`) VALUES ('db98e73dea6bf090ab2be99bb1a732b8', '192.168.0.10', 1, 2, 115, '2016-06-17 10:51:00', '2016-06-17 10:51:00')
---
						'updated_date' => date ( 'Y-m-d H:i:s' )
				]
		];
		if (! ($tokenMmz->load ( $arrayLog ) && $tokenMmz->save ())) {

UPDATE `user` SET `last_login`='2016-06-17 10:51:00' WHERE `id`=115
SELECT * FROM `gcm_token` WHERE (`user_id`=115) AND (`type_token_id`='2')
UPDATE `gcm_token` SET `updated_date`='2016-06-17 10:51:01' WHERE (`token`='dzIfB8Sdm7k:APA91bH8Snq6ngvLCfjjei3qiT9ATWSpI4g0Z-qnpHH3RmJV4SP8y92UZ17unpoOoZDp3_jHyjpmGO6Nz7JJNxvV1aQQL0DDQY00EN5ifWcWOr0O1b6ANzDk7D5NcJzKz9cvn1KehuX6') AND (`user_id`=115) AND (`type_token_id`=2)
---
		$user->last_login = date ( 'Y-m-d H:i:s' );
		// $user->gcm_id = $gcm_id;
		// print $user->last_login; exit();
		$user->save ();

		// Buscamos y actualizamos el token GCM
		$gcm_token = GcmToken::find ()->where ( [
				"user_id" => $user->id,
				"type_token_id" => $device
		] )->one ();
		if ($gcm_token != null) {
			$gcm_token->token = $gcm_id;
			$gcm_token->one_signal_token = $os_id;
			$gcm_token->updated_date = date ( 'Y-m-d H:i:s' );

SELECT * FROM `vw_actual_service` WHERE `user_id`=115
---
			$gcm_token->save ();
		}

		$model_history = VwActualService::find ()->where ( [
				'user_id' => $user->id
		] )->
		// 'status' => '1'

SELECT COUNT(*) FROM `credit_card` WHERE (`user_id`=115) AND (`enable`='1')
---
			$actual_service = true;
		}

		$model_cc = CreditCard::find ()->where ( [
				'user_id' => $user->id,
				'enable' => '1'
		] )->count ();