models/Expert.php

    public function getPushTokens(){
    	$tokens=null;
    	$gcm_tokens = GcmTokenExpert::find ()->select ( [
    			'one_signal_token','token'
    	] )->where ( [
    			"expert_id" => $this->id
    	] )->all ();
---
SELECT `one_signal_token` FROM `gcm_token_expert` WHERE `expert_id`=38