models/User.php

SELECT * FROM `user` WHERE email='leosapuy@zugartek.com' and enable='1' and FK_id_rol>2
---
	public static function findByUsername($username) {
		// return static::findOne(['email' => $username, 'enable' => self::STATUS_ACTIVE]);
		// Solo roles diferentes a usuario and FK_id_rol>2
		return static::find ()->where ( "email='$username' and enable='" . self::STATUS_ACTIVE . "' and FK_id_rol>2" )->one ();

SELECT * FROM `user` WHERE (`id`='107') AND (`enable`=1)
---
	public static function findIdentity($id) {
		return static::findOne ( [
				'id' => $id,
				'enable' => self::STATUS_ACTIVE
		] );

SELECT `one_signal_token` FROM `gcm_token` WHERE `user_id`=115
---
	public function getPushTokens() {
		$tokens = null;
		$gcm_tokens = GcmToken::find ()->select ( [
				'one_signal_token','token'
		] )->where ( [
				"user_id" => $this->id
		] )->all ();